Programm zur Value-Investing Bewertung

pandas.read_excel(io, sheet_name=0, header=0, names=None, index_col=None, parse_cols=None, usecols=None, squeeze=False, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skiprows=None, nrows=None, na_values=None, keep_default_na=True, verbose=False, parse_dates=False, date_parser=None, thousands=None, comment=None, skip_footer=0, skipfooter=0, convert_float=True, mangle_dupe_cols=True, **kwds)

In [2]:
#Input sind Gewinn, Umsatz, Kassenbestand, Multiplikator von 12,5 Anzahl frei im Umlauf befindlicher Aktien

In [41]:
import pandas as pd
df = pd.read_excel('Daten-Value-Bewertung.xlsx', sheet_name=2)

In [42]:
df

   Jahr  Gewinn   Umsatz  Aktien  Kasse
0  2009 -124.63   863.94     NaN    NaN
1  2010  -15.73  1190.64     NaN    NaN
2  2011   75.02  1530.65     NaN    NaN
3  2012   20.57  1293.49     NaN    NaN
4  2013   36.30  1454.42     NaN    NaN
5  2014   21.78  1531.86     NaN    NaN
6  2015    4.84  1248.72   121.0  407.0
7  2016   16.60  1260.20     NaN    NaN
8  2017  121.20  1479.10     NaN  143.8
9  2018   69.90  1778.80   121.0  132.8

In [43]:
jahr = df["Jahr"]
gewinn = df["Gewinn"]
umsatz = df["Umsatz"]
aktien = df["Aktien"]
kasse = df["Kasse"]

In [44]:
#m ist der Multiplikator
m = gewinn/umsatz
print(m)

0   -0.144258
1   -0.013211
2    0.049012
3    0.015903
4    0.024958
5    0.014218
6    0.003876
7    0.013173
8    0.081942
9    0.039296
dtype: float64

In [45]:
#.mean Function errechnet den Durchschnitt des m Dataframes
m.mean()

0.008490825478901575

In [47]:
M = 12.5
G = m.mean()*umsatz[9]
V = M*G
V_kas = V+kasse[9]
V_aktie = V_kas/aktien[9]
V_aktie_50 = V_aktie*0.5
V_aktie_40 = V_aktie*0.6
V_aktie_30 = V_aktie*0.7
V_aktie_20 = V_aktie*0.8
print(V_aktie)
print(V_aktie_20)
print(V_aktie_30)
print(V_aktie_40)
print(V_aktie_50)

2.657797558044434
2.1262380464355473
1.8604582906311038
1.5946785348266606
1.328898779022217

BMW

In [48]:
df1 = pd.read_excel('Daten-Value-Bewertung.xlsx', sheet_name=1)
df1

   Jahr  Gewinn  Umsatz  Aktien    Kasse
0  2009     204   50681     NaN      NaN
1  2010    3218   60477     NaN      NaN
2  2011    4881   68821     NaN      NaN
3  2012    5096   76848     NaN      NaN
4  2013    5314   76058     NaN      NaN
5  2014    5798   80401     NaN      NaN
6  2015    6369   92175   602.0   6122.0
7  2016    6863   94163     NaN      NaN
8  2017    8620   98678     NaN      NaN
9  2018    7117   97480   602.0  10979.0

In [49]:
jahr1 = df1["Jahr"]
gewinn1 = df1["Gewinn"]
umsatz1 = df1["Umsatz"]
aktien1 = df1["Aktien"]
kasse1 = df1["Kasse"]

In [51]:
m1 = gewinn1/umsatz1
m1

0    0.004025
1    0.053210
2    0.070923
3    0.066313
4    0.069868
5    0.072114
6    0.069097
7    0.072884
8    0.087355
9    0.073010
dtype: float64

In [53]:
M = 12.5
G1 = m1.mean()*umsatz1[9]
V1 = M*G1
V_kas1 = V+kasse1[9]
V_aktie1 = V_kas1/aktien1[9]
V_aktie1_50 = V_aktie1*0.5
V_aktie1_40 = V_aktie1*0.6
V_aktie1_30 = V_aktie1*0.7
V_aktie1_20 = V_aktie1*0.8
print(V_aktie1)
print(V_aktie1_20)
print(V_aktie1_30)
print(V_aktie1_40)
print(V_aktie1_50)

18.551152000869397
14.840921600695518
12.985806400608578
11.130691200521637
9.275576000434699

Deutz AG

In [55]:
df2 = pd.read_excel('Daten-Value-Bewertung.xlsx', sheet_name=0)
df2
jahr2 = df2["Jahr"]
gewinn2 = df2["Gewinn"]
umsatz2 = df2["Umsatz"]
aktien2 = df2["Aktien"]
kasse2 = df2["Kasse"]
m2 = gewinn2/umsatz2
print(m2)
m2.mean()
G2 = m2.mean()*umsatz2[9]
V2 = M*G2
V_kas2 = V+kasse2[9]
V_aktie2 = V_kas2/aktien2[9]
V_aktie2_50 = V_aktie2*0.5
V_aktie2_40 = V_aktie2*0.6
V_aktie2_30 = V_aktie2*0.7
V_aktie2_20 = V_aktie2*0.8
print(V_aktie2)
print(V_aktie2_20)
print(V_aktie2_30)
print(V_aktie2_40)
print(V_aktie2_50)

0    0.102538
1    0.117030
2    0.109346
3    0.113573
4    0.119096
5    0.117638
6    0.113414
7    0.114248
8    0.108775
9    0.112193
dtype: float64
5.48276435033395
4.38621148026716
3.8379350452337646
3.28965861020037
2.741382175166975

In [28]:
print(m2.mean())

0.008490825478901575

In [27]:
df2

   Jahr  Gewinn   Umsatz  Aktien  Kasse
0  2009 -124.63   863.94     NaN    NaN
1  2010  -15.73  1190.64     NaN    NaN
2  2011   75.02  1530.65     NaN    NaN
3  2012   20.57  1293.49     NaN    NaN
4  2013   36.30  1454.42     NaN    NaN
5  2014   21.78  1531.86     NaN    NaN
6  2015    4.84  1248.72   121.0  407.0
7  2016   16.60  1260.20     NaN    NaN
8  2017  121.20  1479.10     NaN  143.8
9  2018   69.90  1778.80   121.0  132.8